Kalycito-open-automation/openSAFETY_DEMO/src/app/demo-sn-gpio/target/stm32f103rb/upserial.c
/**
********************************************************************************
\file   upserial.c

\brief  Implements the driver for the uP interconnect serial device

Defines the platform specific functions for the serial to interconnect the
uP-Master with the uP-Slave. (Target is the stm32f103rb board)

*******************************************************************************/

/*------------------------------------------------------------------------------
* License Agreement
*
* Copyright 2013 BERNECKER + RAINER, AUSTRIA, 5142 EGGELSBERG, B&R STRASSE 1
* All rights reserved.
*
* Redistribution and use in source and binary forms,
* with or without modification,
* are permitted provided that the following conditions are met:
*
*   * Redistributions of source code must retain the above copyright notice,
*     this list of conditions and the following disclaimer.
*   * Redistributions in binary form must reproduce the above copyright notice,
*     this list of conditions and the following disclaimer
*     in the documentation and/or other materials provided with the
*     distribution.
*   * Neither the name of the B&R nor the names of its contributors
*     may be used to endorse or promote products derived from this software
*     without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
* AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
* THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* A PARTICULAR PURPOSE ARE DISCLAIMED.
* IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
* ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
* (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
* LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND
* ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
* (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
------------------------------------------------------------------------------*/

/*----------------------------------------------------------------------------*/
/* includes                                                                   */
/*----------------------------------------------------------------------------*/
#include <sn/upserial.h>

#include <common/platform.h>

#include <stm32f1xx_it.h>
#include <stm32f10x_usart.h>
#include <stm32f10x_gpio.h>
#include <stm32f10x_dma.h>

/*============================================================================*/
/*            G L O B A L   D E F I N I T I O N S                             */
/*============================================================================*/

/*----------------------------------------------------------------------------*/
/* const defines                                                              */
/*----------------------------------------------------------------------------*/

/*----------------------------------------------------------------------------*/
/* module global vars                                                         */
/*----------------------------------------------------------------------------*/

/*----------------------------------------------------------------------------*/
/* global function prototypes                                                 */
/*----------------------------------------------------------------------------*/

/*============================================================================*/
/*            P R I V A T E   D E F I N I T I O N S                           */
/*============================================================================*/

/*----------------------------------------------------------------------------*/
/* const defines                                                              */
/*----------------------------------------------------------------------------*/
/* Defines for the USART peripheral */
#define USARTx                          USART1
#define USARTx_RCC_PERIPH               RCC_APB2Periph_USART1


/* Definition for USARTx Pins */
#define USARTx_RX_PIN                   GPIO_Pin_10
#define USARTx_TX_PIN                   GPIO_Pin_9

#define USARTx_GPIO_PORT                GPIOA

#define USARTx_GPIO_RCC_PERIPH          RCC_APB2Periph_GPIOA

/* Defines for the DMA channels */
#define DMAx_Channel_Tx                 DMA1_Channel4
#define DMAx_Channel_Rx                 DMA1_Channel5

#define DMAx_ChannelTx_IRQn             DMA1_Channel4_IRQn
#define DMAx_ChannelRx_IRQn             DMA1_Channel5_IRQn

#define DMAx_ChannelTx_IRQHandler       DMA1_Channel4_IRQHandler
#define DMAx_ChannelRx_IRQHandler       DMA1_Channel5_IRQHandler

#define DMAx_RCC_PERIPH                 RCC_AHBPeriph_DMA1

#define DMAx_FLAG_TE_Tx                 DMA1_FLAG_TE4
#define DMAx_FLAG_TE_Rx                 DMA1_FLAG_TE5
#define DMAx_FLAG_TC_Tx                 DMA1_FLAG_TC4
#define DMAx_FLAG_TC_Rx                 DMA1_FLAG_TC5
#define DMAx_IT_TE_Tx                   DMA1_IT_TE4
#define DMAx_IT_TE_Rx                   DMA1_IT_TE5
#define DMAx_IT_TC_Tx                   DMA1_IT_TC4
#define DMAx_IT_TC_Rx                   DMA1_IT_TC5

/*----------------------------------------------------------------------------*/
/* local types                                                                */
/*----------------------------------------------------------------------------*/

/*----------------------------------------------------------------------------*/
/* local vars                                                                 */
/*----------------------------------------------------------------------------*/
static tUpSerialTransferFin pfnTransfFin_l = NULL;      /**< This callback is called when a transfer is finished */
static tUpSerialReceiveFin pfnReceiveFin_l = NULL;      /**< This callback is called on reception of a new frame */
static tUpSerialTransferError pfnTransfError_l = NULL;  /**< This callback is called on serial error */

static volatile BOOLEAN fTxFinished_l = FALSE;       /**< Transfer finished flag for blocking mode */
static volatile BOOLEAN fRxFinished_l = FALSE;       /**< Receive finished flag for blocking mode */

