Kalycito-open-automation/openSAFETY_DEMO/src/app/demo-sn-gpio/target/stm32f103rb/upserial.c
/*----------------------------------------------------------------------------*/
/* local function prototypes                                                  */
/*----------------------------------------------------------------------------*/
static void initGpio(void);
static void initUsart(void);
static void initDmaRx(volatile UINT8 * pTargBase_p, UINT32 targLen_p);
static void initDmaTx(volatile UINT8 * pSrcBase_p, UINT32 srcLen_p);
static void closeDma(void);
static void initNvic(void);

static void usartReceive(volatile UINT8 * pData_p, UINT32 size_p);
static void usartTransmit(volatile UINT8 * pData_p, UINT32 size_p);

static BOOLEAN waitForTransferFinished(volatile BOOLEAN * pTransFin_p, UINT32 timeoutMs_p);

/*============================================================================*/
/*            P U B L I C   F U N C T I O N S                                 */
/*============================================================================*/

/*----------------------------------------------------------------------------*/
/**
\brief  Initialize the up serial device

This function initializes the serial device connecting the uP-Master with
the uP-Slave.

\retval TRUE    On success
\retval FALSE   USART initialization failed

\ingroup module_serial
*/
/*----------------------------------------------------------------------------*/
BOOLEAN upserial_init(void)
{
    /* Initialize all needed peripherals */
    initGpio();
    initUsart();

    /* The DMA channels are initialized on transfer */
    closeDma();

    initNvic();

    /* Globally enable the USARTx core */
    USART_Cmd(USARTx, ENABLE);

    return TRUE;
}


/*----------------------------------------------------------------------------*/
/**
\brief  Close the USART serial

\ingroup module_serial
*/
/*----------------------------------------------------------------------------*/
void upserial_exit(void)
{
    pfnTransfFin_l =  NULL;
    pfnReceiveFin_l = NULL;
    pfnTransfError_l = NULL;

    USART_DeInit(USARTx);

    /* Close the DMAx channels */
    closeDma();

    /* Close the GPIO pins */
    GPIO_DeInit(USARTx_GPIO_PORT);
}

/*----------------------------------------------------------------------------*/
/**
\brief  Register serial callback functions

\param pfnTransfFin_p     Pointer to the transfer finished callback
\param pfnReceivefFin_p   Pointer to the receive finished callback
\param pfnTransfError_p   Pointer to the transfer error callback

\ingroup module_serial
*/
/*----------------------------------------------------------------------------*/
void upserial_registerCb(tUpSerialTransferFin pfnTransfFin_p,
                         tUpSerialReceiveFin pfnReceivefFin_p,
                         tUpSerialTransferError pfnTransfError_p)
{
    pfnTransfFin_l = pfnTransfFin_p;
    pfnReceiveFin_l = pfnReceivefFin_p;
    pfnTransfError_l = pfnTransfError_p;
}

/*----------------------------------------------------------------------------*/
/**
\brief  Deregister serial callback functions

\ingroup module_serial
*/
/*----------------------------------------------------------------------------*/
void upserial_deRegisterCb(void)
{
    pfnTransfFin_l = NULL;
    pfnReceiveFin_l = NULL;
    pfnTransfError_l = NULL;
}

/*----------------------------------------------------------------------------*/
/**
\brief  Perform an USART transfer

This function starts an USART transfer to send data to the second processor.

\note This function is blocking

\param[in] pData_p       Pointer to the transmit data
\param[in] size_p        Size of the transmit data

\retval TRUE        On success
\retval FALSE       USART send failed

\ingroup module_serial
*/
/*----------------------------------------------------------------------------*/
BOOLEAN upserial_transmitBlock(volatile UINT8 * pData_p, UINT32 size_p)
{
    BOOLEAN fReturn = FALSE;

    if(pData_p != NULL && size_p > 0)
    {
        usartTransmit(pData_p, size_p);

        /* Wait until DMA transfer is finished */
        if(waitForTransferFinished(&fTxFinished_l, 0xFFFF))
        {
            /* Frame successfully transmitted */
            fReturn = TRUE;
        }
        else
        {
            /* Timeout occurred */
            USART_DMACmd(USARTx, USART_DMAReq_Tx, DISABLE);
        }

        fTxFinished_l = FALSE;
    }

    return fReturn;
}


/*----------------------------------------------------------------------------*/
/**
\brief  Perform an USART reception

This function blocks until the desired amount of bytes is received from the uart
serial.

\param[in] pData_p       Pointer to the received data
\param[in] size_p        Size of the received data
\param[in] timeoutMs_p   The timeout in ms

\retval TRUE        On success
\retval FALSE       USART receive failed

\ingroup module_serial
*/
/*----------------------------------------------------------------------------*/
BOOLEAN upserial_receiveBlock(volatile UINT8 * pData_p, UINT32 size_p, UINT32 timeoutMs_p)
{
    BOOLEAN fReturn = FALSE;

    if(pData_p != NULL && size_p > 0)
    {
        usartReceive(pData_p, size_p);

        /* Wait until DMA transfer is finished */
        if(waitForTransferFinished(&fRxFinished_l, timeoutMs_p))
        {
            /* Frame successfully received */
            fReturn = TRUE;
        }
        else
        {
            /* Timeout occurred */
            USART_DMACmd(USARTx, USART_DMAReq_Rx, DISABLE);
        }

        fRxFinished_l = FALSE;

    }

    return fReturn;
}

/*----------------------------------------------------------------------------*/
/**
\brief  Enable a DMA reception

This function enables a DMA reception via the local uP-Master <-> uP-Slave
serial device.

\param[in] pData_p       Pointer to the received data
\param[in] size_p        Size of the received data

\retval TRUE        On success
\retval FALSE       USART receive failed

\ingroup module_serial
*/
/*----------------------------------------------------------------------------*/
BOOLEAN upserial_enableReceive(volatile UINT8 * pData_p, UINT32 size_p)
{
    BOOLEAN fReturn = FALSE;

    if(pData_p != NULL && size_p > 0)
    {
        usartReceive(pData_p, size_p);

        fReturn = TRUE;
    }

    return fReturn;
}

