Kalycito-open-automation/openSAFETY_DEMO/src/app/demo-sn-gpio/target/stm32f103rb/upserial.c
/*----------------------------------------------------------------------------*/
/**
\brief  Start an USART transfer

This function starts an USART DMA transfer to send data to the second
processor.

\param[in] pData_p       Pointer to the transmit data
\param[in] size_p        Size of the transmit data

\retval TRUE        On success
\retval FALSE       USART send failed

\ingroup module_serial
*/
/*----------------------------------------------------------------------------*/
BOOLEAN upserial_transmit(volatile UINT8 * pData_p, UINT32 size_p)
{
    BOOLEAN fReturn = FALSE;

    if(pData_p != NULL && size_p > 0)
    {
        usartTransmit(pData_p, size_p);

        fReturn = TRUE;
    }

    return fReturn;
}

/*============================================================================*/
/*            P R I V A T E   F U N C T I O N S                               */
/*============================================================================*/
/* \name Private Functions */
/* \{ */

/*----------------------------------------------------------------------------*/
/**
\brief  Initialize the USART GPIO pins

\ingroup module_serial
*/
/*----------------------------------------------------------------------------*/
static void initGpio(void)
{
    GPIO_InitTypeDef GPIO_InitStructure;

    memset(&GPIO_InitStructure, 0, sizeof(GPIO_InitTypeDef));

    /* Enable peripheral clocks */
    RCC_APB2PeriphClockCmd(USARTx_GPIO_RCC_PERIPH, ENABLE);
    RCC_APB2PeriphClockCmd(RCC_APB2Periph_AFIO, ENABLE);

    /*  USARTx: TX */
    GPIO_InitStructure.GPIO_Pin = USARTx_TX_PIN;
    GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_AF_PP;
    GPIO_Init(USARTx_GPIO_PORT, &GPIO_InitStructure);

    /*  USARTx: RX */
    GPIO_InitStructure.GPIO_Pin = USARTx_RX_PIN;
    GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
    GPIO_Init(USARTx_GPIO_PORT, &GPIO_InitStructure);
}

/*----------------------------------------------------------------------------*/
/**
\brief  Initialize the USART core

Setup USART core for receive and transmit

\ingroup module_serial
*/
/*----------------------------------------------------------------------------*/
static void initUsart(void)
{
    USART_InitTypeDef USART_InitStructure;

    memset(&USART_InitStructure, 0, sizeof(USART_InitTypeDef));

    /* Enable the USART periph */
    RCC_APB2PeriphClockCmd(USARTx_RCC_PERIPH, ENABLE);

    /* Configure the USART core */
    USART_StructInit(&USART_InitStructure);
    USART_InitStructure.USART_BaudRate = 3686400; //1843200//; //10500000;
    USART_InitStructure.USART_WordLength = USART_WordLength_8b;
    USART_InitStructure.USART_StopBits = USART_StopBits_1;
    USART_InitStructure.USART_Parity = USART_Parity_No;
    USART_InitStructure.USART_Mode = USART_Mode_Rx | USART_Mode_Tx;
    USART_InitStructure.USART_HardwareFlowControl = USART_HardwareFlowControl_None;
    USART_Init(USARTx, &USART_InitStructure);
}

/*----------------------------------------------------------------------------*/
/**
\brief  Initialize USART DMA for receive

Setup the DMA for receive from USART to RAM.

\param[in] pTargBase_p      Pointer to the base address of the target buffer
\param[in] targLen_p        The length of the target buffer

\ingroup module_serial
*/
/*----------------------------------------------------------------------------*/
static void initDmaRx(volatile UINT8 * pTargBase_p, UINT32 targLen_p)
{
    DMA_InitTypeDef DMA_InitStructure;

    /* Configure DMAx - ChannelRx (USART -> memory) */
    DMA_StructInit(&DMA_InitStructure);
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)&USARTx->DR;     /* Address of peripheral the DMA must map to */
    DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)pTargBase_p;         /* Variable to which received data will be stored */
    DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralSRC;
    DMA_InitStructure.DMA_BufferSize = targLen_p;                         /* Buffer size */
    DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
    DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
    DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
    DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;
    DMA_InitStructure.DMA_Priority = DMA_Priority_High;
    DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
    DMA_Init(DMAx_Channel_Rx, &DMA_InitStructure);

    DMA_ITConfig(DMAx_Channel_Rx, DMA_IT_TC | DMA_IT_TE, ENABLE);
}

/*----------------------------------------------------------------------------*/
/**
\brief  Initialize USART DMA for transmit

Setup the DMA for transmit from RAM to USART.

\param[in] pSrcBase_p      Pointer to the base address of the source buffer
\param[in] srcLen_p        The length of the source buffer

\ingroup module_serial
*/
/*----------------------------------------------------------------------------*/
static void initDmaTx(volatile UINT8 * pSrcBase_p, UINT32 srcLen_p)
{
    DMA_InitTypeDef DMA_InitStructure;

    /* Configure DMAx - ChannelTx (memory -> USART) */
    DMA_StructInit(&DMA_InitStructure);
    DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)&USARTx->DR;     /* Address of peripheral the DMA must map to */
    DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)pSrcBase_p;          /* Variable from which data will be transmitted */
    DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralDST;
    DMA_InitStructure.DMA_BufferSize = srcLen_p;                          /* Buffer size */
    DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
    DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
    DMA_InitStructure.DMA_PeripheralDataSize = DMA_PeripheralDataSize_Byte;
    DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
    DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;
    DMA_InitStructure.DMA_Priority = DMA_Priority_High;
    DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
    DMA_Init(DMAx_Channel_Tx, &DMA_InitStructure);

    DMA_ITConfig(DMAx_Channel_Tx, DMA_IT_TC | DMA_IT_TE, ENABLE);
}

