Kalycito-open-automation/openSAFETY_DEMO/src/app/demo-sn-gpio/target/stm32f103rb/upserial.c
/*----------------------------------------------------------------------------*/
/**
\brief  Close the DMA channels

\ingroup module_serial
*/
/*----------------------------------------------------------------------------*/
static void closeDma(void)
{
    /* Disable DMA interrupts */
    DMA_ITConfig(DMAx_Channel_Rx, DMA_IT_TC | DMA_IT_TE, DISABLE);
    DMA_ITConfig(DMAx_Channel_Tx, DMA_IT_TC | DMA_IT_TE, DISABLE);

    /* Close the DMA channels */
    DMA_DeInit(DMAx_Channel_Rx);
    DMA_DeInit(DMAx_Channel_Tx);
}

/*----------------------------------------------------------------------------*/
/**
\brief  Initialize the DMA interrupts in NVIC

Setup transfer finished and transfer error interrupts for both DMA
channels.

\ingroup module_serial
*/
/*----------------------------------------------------------------------------*/
static void initNvic(void)
{
    NVIC_InitTypeDef   NVIC_InitStructure;

    memset(&NVIC_InitStructure, 0, sizeof(NVIC_InitTypeDef));

    /* Enable DMA1 Channel2 interrupt */
    NVIC_InitStructure.NVIC_IRQChannel = DMAx_ChannelRx_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0x0E;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0x01;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);

    /* Enable DMA1 Channel3 interrupt */
    NVIC_InitStructure.NVIC_IRQChannel = DMAx_ChannelTx_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 0x0E;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0x01;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);
}

/*----------------------------------------------------------------------------*/
/**
\brief  Start an USART DMA reception

\param[in] pData_p      Pointer to the base address of the target buffer
\param[in] size_p       The length of the target buffer

\ingroup module_serial
*/
/*----------------------------------------------------------------------------*/
static void usartReceive(volatile UINT8 * pData_p, UINT32 size_p)
{
    /* Initialize the DMA receive channel with the new base address */
    initDmaRx(pData_p, size_p);

    /* Enable the DMA receive channel */
    DMA_Cmd(DMAx_Channel_Rx, ENABLE);

    /* Enable the USART DMA receive channel */
    USART_DMACmd(USARTx, USART_DMAReq_Rx, ENABLE);
}

/*----------------------------------------------------------------------------*/
/**
\brief  Start an USART DMA transmission

\param[in] pData_p      Pointer to the base address of the source buffer
\param[in] size_p       The length of the source buffer

\ingroup module_serial
*/
/*----------------------------------------------------------------------------*/
static void usartTransmit(volatile UINT8 * pData_p, UINT32 size_p)
{
    /* Initialize the DMA receive channel with the new base address */
    initDmaTx(pData_p, size_p);

    /* Enable the DMA transmit channel */
    DMA_Cmd(DMAx_Channel_Tx, ENABLE);

    /* Enable the USARTx DMA interface (This starts the transfer!) */
    USART_DMACmd(USARTx, USART_DMAReq_Tx, ENABLE);
}

/*----------------------------------------------------------------------------*/
/**
\brief  DMA receive channel interrupt handler (USART -> memory)

\ingroup module_serial
*/
/*----------------------------------------------------------------------------*/
void DMAx_ChannelRx_IRQHandler(void)
{
    if(DMA_GetITStatus(DMAx_IT_TC_Rx) == SET)
    {
        /* Disable the DMA channel */
        DMA_Cmd(DMAx_Channel_Rx, DISABLE);

        fRxFinished_l = TRUE;

        /* Call receive finished callback function */
        if(pfnReceiveFin_l != NULL)
            pfnReceiveFin_l();

        /* Clear the interrupt flag */
        DMA_ClearFlag(DMAx_FLAG_TC_Rx);
    }
    else if(DMA_GetITStatus(DMAx_IT_TE_Rx) == SET)
    {   /* Transfer error! */

        /* Call transfer error callback function */
        if(pfnTransfError_l != NULL)
            pfnTransfError_l();

        DMA_ClearFlag(DMAx_FLAG_TE_Rx);
    }
}



/*----------------------------------------------------------------------------*/
/**
\brief  DMA transmit channel interrupt handler (memory -> USART)

\ingroup module_serial
*/
/*----------------------------------------------------------------------------*/
void DMAx_ChannelTx_IRQHandler(void)
{
    if(DMA_GetITStatus(DMAx_IT_TC_Tx) == SET)
    {
        /* Disable the DMA channel */
        DMA_Cmd(DMAx_Channel_Tx, DISABLE);

        fTxFinished_l = TRUE;

        /* Call transfer finished callback function */
        if(pfnTransfFin_l != NULL)
            pfnTransfFin_l();

        /* Clear the interrupt flag */
        DMA_ClearFlag(DMAx_FLAG_TC_Tx);
    }
    else if(DMA_GetITStatus(DMAx_IT_TE_Tx) == SET)
    {
        /* Call transfer error callback function */
        if(pfnTransfError_l != NULL)
            pfnTransfError_l();

        DMA_ClearFlag(DMAx_FLAG_TE_Tx);
    }
}

/*----------------------------------------------------------------------------*/
/**
\brief  Wait until the transfer is finished

\param[in] pTransFin_p      Pointer to the transfer finished flag
\param[in] timeoutMs_p      Time in ms until timeout

\ingroup module_serial
*/
/*----------------------------------------------------------------------------*/
static BOOLEAN waitForTransferFinished(volatile BOOLEAN * pTransFin_p, UINT32 timeoutMs_p)
{
    BOOLEAN fTransFin = FALSE;
    volatile UINT32 currTime = tickCnt_l;
    UINT32 timeoutTime = currTime + timeoutMs_p;

    /* Wait until timeout is reached or transfer is finished */
    while(*pTransFin_p == FALSE && currTime < timeoutTime)
    {
        currTime = tickCnt_l;
    }

    fTransFin = *pTransFin_p;

    return fTransFin;
}

/* \} */
